Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/api_spec_plugin.po
Languages: ru

source: ApiSpec plugin
ru: Плагин ApiSpec

source: Plugin **ApiSpecPlugin** adds the following features:
ru: Плагин **ApiSpecPlugin** добавляет:

source: Auto-generated documentation for JSON API, **ResourceList** and **ResourceDetail** resource managers.
ru: Автоматически генерирующуюся документацию для JSONAPI, для ресурс менеджеров **ResourceList** и **ResourceDetail**

source: Support for auto-generating documentation of RPC API made with :ref:`EventPlugin <event_plugin>`
ru: Поддержка генерации документации для RPC API созданного с помощью плагина :ref:`EventPlugin <event_plugin>`

source: Tag-based API grouping in **swagger**.
ru: Группировка созданного API по тегам (в **swagger**).

source: Plugin is based on **apispec** using :ref:`RestfulPlugin <restful_plugin>`.
ru: Плагин построен поверх **apispec** с подключением плагина :ref:`RestfulPlugin <restful_plugin>`.

source: How to use
ru: Работа с плагином

source: To start, do the following:
ru: Чтобы начать работать с плагином, нужно:

source: Add a plugin instance at application initialization.
ru: При инициализации приложения добавляем экземпляр плагина.

source: Plugin supports the following parameters:
ru: При инициализации плагина, принимаются следующие параметры:

source: :code:`app: Flask` - application instance
ru: :code:`app: Flask` - экземпляр приложения

source: :code:`decorators: Tuple = None` - tuple with decorators which will get attached to **swagger**
ru: :code:`decorators: Tuple = None` - кортеж с декораторами, которые повесятся на роутер **swagger**

source: :code:`tags: Dict[str, str] = None` - list of tags with descriptions; routers can be grouped by these tags.
ru: :code:`tags: Dict[str, str] = None` - список тегов с их описанием, они потом применяются при группировании роутеров в группы по тегам.

source: When declaring routers, you can specify a tag :code:`tag: str`. Tag should be listed at plugin initialization, or you'll get an error.
ru: При объявлении роутеров, добавляется параметр :code:`tag: str` если здесь указать тег, который не описан при инициализации плагина, то выскочит ошибка.

source: When adding a RPC API view made with :ref:`EventPlugin <event_plugin>`, describe the API using yaml in the view beginning `API description structure <https://swagger.io/docs/specification/data-models/>`_.
ru: Если добавляем RPC API view с использованием плагина :ref:`EventPlugin <event_plugin>`, то в начале view описываем API используя yaml(`структура описания API <https://swagger.io/docs/specification/data-models/>`_).

source: Plugin usage example is available :ref:`in EventPlugin description <event_plugin>`.
ru: Пример работы с плагином можно посмотреть в :ref:`примере у плагина EventPlugin <event_plugin>`.
