Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/event_plugin.po
Languages: ru

source: Event Plugin
ru: Плагин Event (событийный плагин / RPC плагин)

source: Allows to create Event-driven API (RPC api - custom views on top of general views)
ru: Позволяет создавать событийное API (RPC)

source: Integrates with **ApiSpecPlugin** to make RPC documentation which is displayed along-side with non-RPC documentation. Views are described in **yaml**.
ru: Интегрируется с плагином **ApiSpecPlugin** позволяя создавать документацию для RPC views и отображать вместе с общей документацией. Описание view производится при помощи **yaml**.

source: integrates with **PermissionPlugin**, and view can access restrictions for every model. View is restricted with general decorators, which are set up when API gets initialized.
ru: Интегрируется с плагином **PermissionPlugin**, можно из view получить доступ к ограничения по любой модели. Также доступ к view ограничивается общими декораторами, которые задаются при инициализации API.

source: How to use
ru: Работа с плагином

source: To create an RPC API for a model, do the following:
ru: Чтобы создать RPC API связанного с какой-либо моделью, нужно:

source: Create a class from :code:`combojsonapi.event.resource.EventsResource`. We'll detail this later.
ru: Создать класс от :code:`combojsonapi.event.resource.EventsResource`, ниже будет более подробно сказано об этом.

source: Resource manager gets an :code:`events` attribute. There, specify a class you've just created. If you use a :code:`ResourceDetail` manager, every RPC API will receive model id specified in the resource manager.
ru: В ресурс менеджере используется атрибут :code:`events`, там нужно указать класс, созданный в первом пункте. Если использовать в ресурс менеджере :code:`ResourceDetail`, то в каждую view RPC API будет приходить также id модели (которая указана в ресурс менеджере).

source: How plugin works
ru: Описание работы плагина

source: After you create a class inherited from :code:`combojsonapi.event.resource.EventsResource`, any method with name starting with :code:`event_` will be considered as a separate view. Its URL view will be: :code:`.../<url of the resource manager, which RPC API method class is attached to>/<method name: event_...`.
ru: После того как создали класс, унаследованный от :code:`combojsonapi.event.resource.EventsResource`,любой метод в этом классе, который начинается с :code:`event_` будет считаться самостоятельным view.Адрес нового view будет формироваться в формате :code:`.../<url ресурс менеджера, к которому привязанданный класс с методами RPC API>/event_<название нашего метода, после event_>`.

source: There's a way to override url suffix, see :ref:`Event Plugin extra params<Event-Plugin-extra-params>`.
ru: Есть возможность переопределить суффикс url, для этогоиспользуйте see :ref:`extra параметры Event плагина <Event-Plugin-extra-params>`.

source: POST resources are created by default. You can make a GET resource, if you start the method's name with :code:`event_get_`. :code:`event_post_` is supported too, which would make a POST resource, again.
ru: По умолчанию создаются POST ресурсы. Но можно создать GET ресурс, назвав метод :code:`event_get_something`. Также поддерживается :code:`event_post_something` - создастся POST ресурс.

source: There's a way to override method, see :ref:`Event Plugin extra params<Event-Plugin-extra-params>`.
ru: Есть возможность переопределить метод, для этогоиспользуйте see :ref:`extra параметры Event плагина <Event-Plugin-extra-params>`.

source: **Other methods and attributes of the Event class won't be visible in a view.**
ru: **Другие методы и атрибуты Event класса не будут видны внутри view.**

source: How to describe a view
ru: Описания view

source: Method :code:`event[_post|get]_<method name>` accepts the following params:
ru: Метод :code:`event[_опционально тип запроса]_<название метода>` должен принимать следующие параметры:

source: :code:`id: int` [optional] - model instance id, if this view's class is specified in :code:`ResourceDetail` resource manager.
ru: :code:`id: int` [опционально] - id сущности модели. Если класс с данным view указан в ресурс менеджере :code:`ResourceDetail`.

source: :code:`_permission_user: PermissionUser = None` - permissions for logged in user (if **PermissionPlugin** is used)
ru: :code:`_permission_user: PermissionUser = None` - пермишены для данного авторизованного пользователя (при условии, что подключен плагин **PermissionPlugin**)

source: Describe answers in JSON API format.
ru: При описании ответов view используйте формат JSONAPI

source: Document the view in yaml in the method beginning, so **ApiSpecPlugin** could automatically populate the swagger page with event method description.
ru: В начале метода нужно описать документацию к view на yaml (swagger/openapi), чтобы выполнить интеграцию с плагином автодокументации **ApiSpecPlugin**

source: Plugin extra params
ru: Extra параметры плагина

source: Event resource can be changed via extra params. Accepted params:
ru: Event ресурс может быть модифицирован при помощи extra параметров:

source: :code:`method` - view method - GET/POST/PUT/PATCH/DELETE
ru: :code:`method` - метод view - GET/POST/PUT/PATCH/DELETE

source: :code:`url_suffix` - custom url suffix to override using method name
ru: :code:`url_suffix` - кастомный суффикс url вместо имени метода (функции)

source: In this example a new view will be created. It will be :code:`PUT /user/{id}/update_online/`. Without event extra it will be :code:`POST /user/{id}/event_update_user_online_status/`.
ru: В этом примере новый view будет создан: :code:`PUT /user/{id}/update_online/`. Без extra параметров для event результат был бы такой: :code:`POST /user/{id}/event_update_user_online_status/`.

source: Plugin usage sample
ru: Пример подключения плагина

source: We want to upload a user avatar. We'll also load **ApiSpecPlugin**, so we can see it in action.
ru: Мы хотим загрузить аватарку пользователя. Здесь мы также используем плагин **ApiSpecPlugin**, чтобы посмотреть на его работу.
