Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru

source: combojsonapi: Plugins to improve functionality of the Flask-COMBO-JSONAPI
ru: combojsonapi: Плагины для улучшения Flask-COMBO-JSONAPI

source: ``ComboJSONAPI`` is a set of plugins made for Flask-COMBO-JSONAPI_.
ru: ``ComboJSONAPI`` это набор плагинов для Flask-COMBO-JSONAPI_.

source: **Permission** plugin enables access control to models and their fields in GET, POST, PATCH and DELETE methods.
ru: Плагин **Permission** добавляет возможность управления доступом к моделям и отдельным полям моделей при обращении методами GET, POST, PATCH и DELETE.

source: **ApiSpecPlugin** simplifies automated JSONAPI documentation.
ru: Плагин **ApiSpecPlugin** упрощает автоматическое создание документации

source: **RestfulPlugin** for apispec_ library in the **ApiSpecPlugin** enables documenting GET parameters with Marshmallow schemas.
ru: Плагин **RestfulPlugin** для библиотеки apispec_ используется в плагине **ApiSpecPlugin** и добавляет документацию GET параметров при помощи схем Marshmallow.

source: **EventPlugin** enables RPC creation for those cases when you can't make it with pure JSON:API.
ru: Плагин **EventPlugin** добавляет создание RPC на тот случай, когда недостаточно JSON:API.

source: **PostgreSqlJSONB** features filtering and sorting data by first-level key values of JSONB values in PostgreSQL.
ru: Плагин **PostgreSqlJSONB** добавляет фильтрацию и сортировку данных на первом уровне JSONB ключей-значений в PostgreSQL.

source: Documentation
ru: Документация

source: Contents
ru: Содержание

source: To update docs:
ru: Чтобы обновить документацию:

source: add new langs via additional flag "-l es"
ru: добавьте новые языки при помощи флага "-l es"

source: add translations to :code:`docs/locale/<lang>/LC_MESSAGES`
ru: добавьте перевод в :code:`docs/locale/<lang>/LC_MESSAGES`

source: to check your translations run :code:`sphinx-build -b html -D language=ru . _build/html/ru` and check generated HTML files
ru: чтобы проверить ваш перевод выполните :code:`sphinx-build -b html -D language=ru . _build/html/ru` и проверьте сгенерированные HTML файлы
