Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/permission_plugin.po
Languages: ru

source: Permission plugin
ru: Плагин Permission

source: **Permission** plugin enables features:
ru: Плагин **Permission** позволяет:

source: Attach decorators to routers.
ru: Повесить декораторы на роутеры

source: Restrict what data is returned on objects (GET method):
ru: Добавить ограничительную логику при выгрузке объектов (GET запрос):

source: by attribute (they won't be requested from database unless mentioned specifically);
ru: ограничить выгрузку по атрибутам (они не будут даже выгружаться из БД, если только специально к ним не обратиться);

source: by rows;
ru: ограничить выгрузку по строкам;

source: by rows based on complex filters, e. g. accessible for users in a specific group, or group owner.
ru: ограничить выгрузку по строкам в зависимости от результатов сложных фильтров, например доступны только те пользователи, которые состоят в группе, в которой данный пользователь является владельцем

source: Pre-parsing (sanitizing) input data for patching (PATCH method) and creating objects (POST method).
ru: Предобработка данных для обновления объекта (PATCH запрос) и создания (POST запрос).

source: Check if user can delete an object.
ru: Выполнить проверку на возможность удаления объекта данным пользователем.

source: How to use
ru: Работа с плагином

source: To create a permission system:
ru: Чтобы создать систему пермишенов для какой-либо модели, нужно:

source: Inherit a class from :code:`combojsonapi.permission.permission_system.PermissionMixin` (detailed below).
ru: Создать класс от :code:`combojsonapi.permission.permission_system.PermissionMixin`, ниже будет более подробно сказано об этом

source: In resource manager, specify which methods use this permissions class in :code:`data_layer`.
ru: В ресурс менеджере в :code:`data_layer` указать, какие методы должны использовать данный класс с пермишенами

source: If you need to disable permission decorators for the resource, set the following attribute: :code:`disable_global_decorators`.
ru: Если нам нужно, чтобы на конкретный ресурс не накручивались пермишн декораторы, необходимо в ресурсе указать атрибут :code:`disable_global_decorators`

source: Shared permissions are applied automatically by :code:`permission_manager` https://flask-combo-jsonapi.readthedocs.io/en/latest/permission.html. To disable it, set :code:`disable_permission` attribute. Example:
ru: Общие пермишены можно применять даже не накручивая на каждый ресурс отдельно, для этого есть:code:`permission_manager` https://flask-combo-jsonapi.readthedocs.io/en/latest/permission.html.Для того, чтобы отключить его, нужно у класса назначить :code:`disable_permission`. Например:

source: By default only required fields and allowed by permission fields are fetched from database. If your model uses property which refers to a property which was not fetched (was not requested in your query), you need to declare required fields in the model's :code:`Meta` class in attribute :code:`required_fields`. Otherwise sqlalchemy will fetch these fields using additional db requests which will slow down your request. For example:
ru: По умолчанию из БД выгружаются только поля, указанные в запросеи разрешенные в пермишенах. Если в вашей модели есть property, который обращается к незапрошенному полю модели (но при этом это поле не нужно возвращать в запросе), то такие зависимости необходимо указать у модели в классе :code:`Meta`в атрибуте :code:`required_fields`. Например:

source: PermissionMixin class API
ru: API класса PermissionMixin

source: **Properties:**
ru: **Свойства:**

source: User permissions for GET method. Contains properties:
ru: Разрешения для пользователя в методе get. Содержит свойства:

source: :code:`filters: List` - filters list to apply when requesting objects. E. g., it's possible to allow user to view his profile only, not anyone else's.
ru: :code:`filters: List` - список фильтров, которые нужно применить при выгрузке объектов. Например можем задать, чтобы пользователь при выгрузке видел только себя

source: :code:`joins: List` - models list to join when requesting objects. E. g. allow a user to view users of group he is part of.
ru: :code:`joins: List` - список джойнов, которые нужно присоединить к данному запросу на выгрузку. Например пользователь может увидеть только тех пользователей, которые входят в некую группу, в которую он входит.

source: :code:`allow_columns: Dict[str, int]` - allowed model attributes and permission weight (more is higher priority), which is useful for managing more and less restrictive permissions.
ru: :code:`allow_columns: Dict[str, int]` - атрибуты модели, которые доступны и вес доступа, влияет на то что пермишены могут быть разрешающими, а могут быть запрещающими

source: :code:`forbidden_columns: Dict[str, int]` - forbidden model attributes and permission weight.
ru: :code:`forbidden_columns: Dict[str, int]` - атрибуты модели, которые запрещены и вес доступа, влияет на то что пермишены могут быть разрешающими, а могут быть запрещающими

source: :code:`columns: Set[str]` - accessible model attributes after applying all permissions by weight in ascending order.
ru: :code:`columns: Set[str]` - атрибуты модели, доступны пользователю, после сложения разрешающий и запрещающих массивов по весу

source: User permissions for PATCH method. Contains properties:
ru: Разрешения для пользователя в методе patch. Содержит свойства:

source: User permissions for POST method. Contains properties:
ru: Разрешения для пользователя в методе post. Содержит свойства:

source: **Methods:**
ru: **Методы:**

source: GET method permissions for current user, described in PermissionForGet
ru: Ограничения на элементы описанные в PermissionForGet для данного пользователя в GET запросах

source: :code:`bool many` - if model is requested via ResourceList (True) or ResourceDetail (False);
ru: :code:`bool many` - запрашивают через ResourceList или ResourceDetail

source: :code:`PermissionUser user_permission` - permissions for current logged in user; all permissions are available, including other models and methods (GET, POST, PATCH).
ru: :code:`PermissionUser user_permission` - ограничения для данного пользователя, можно получить доступ к ограничениям по другим моделям для данного пользователя для разных методов (GET, POST, PATCH).

source: Pre-parses input data according to permissions. Returns parsed data for the object being created.
ru: Предобработка данных в соответствие с ограничениями перед создание объекта. Должен вернуть обработанные данные для нового объекта

source: :code:`Dict data` - unparsed data for the object being created;
ru: :code:`Dict data` - данные для создания объекта;

source: POST method permissions for current user, described in PermissionForGet
ru: Ограничения на элементы описанные в PermissionForPost для данного пользователя в POST запросах

source: Pre-parses input data according to permissions. Returns parsed data for the object being updated.
ru: Предобработка данных в соответствие с ограничениями перед обновлением объекта. Должен вернуть обработанные данные для обновления объекта

source: :code:`Dict data` - input data validated according to marshmallow schema;
ru: :code:`Dict data` - входные данные, прошедшие валидацию через схему marshmallow;

source: :code:`obj` - object being updated;
ru: :code:`obj` - обновляемый объект из БД;

source: PATCH method permissions for current user, described in PermissionForGet
ru: Ограничения на элементы описанные в PermissionForPatch для данного пользователя в PATCH запросах

source: :code:`obj` - object being deleted
ru: Проверка пермишеннов на возможность удалить данный объект (obj). Если хотя бы одна из функций, вернёт False, то удаление не произойдёт

source: Resource Manager Descriptions
ru: Описания в ресурс менеджерах

source: In :code:`data_layer` section you can specify following permission types:
ru: В разделе :code:`data_layer` можно указать следующие типы пермишенов:

source: :code:`permission_get: List` - list of classes, which :code:`get` method will be requested from;
ru: :code:`permission_get: List` - список классов, из которых будет запрашиваться метод :code:`get`

source: :code:`permission_post: List` - list of classes, which :code:`post_permission` and :code:`post_data` methods will be requested from;
ru: :code:`permission_post: List` - список классов, из которых будет запрашиваться метод :code:`post_permission` и :code:`post_data`

source: :code:`permission_patch: List` - list of classes, which :code:`patch_permission` and :code:`patch_data` methods will be requested from;
ru: :code:`permission_patch: List` - список классов, из которых будет запрашиваться метод :code:`patch_permission` и :code:`patch_data`

source: :code:`permission_delete: List` - list of classes, which :code:`delete` method will be requested from;
ru: :code:`permission_delete: List` - список классов, из которых будет запрашиваться метод :code:`delete`

source: Usage example
ru: Пример подключения плагина

source: Example of loading various object attributes depending on the address at which the object was requested
ru: Пример выгрузки различных атрибутов объекта в зависимости от адреса, по которому был запрошен объект

source: :code:`computer_list, phone_list` - endpoints in pattern of the routing system:
ru: :code:`computer_list, phone_list` - endpoint'ы схемы системы маршрутизации:
