Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/postgresql_jsonb_plugin.po
Languages: ru

source: PostgreSqlJSONB plugin
ru: Плагин PostgreSqlJSONB

source: **PostgreSqlJSONB** plugins features:
ru: Плагин **PostgreSqlJSONB** позволяет:

source: Allows working with **JSONB** PostgreSql fields similarly to a regular model on the client side. **get** requests are filtered and ordered by first-level JSONB fields.
ru: Работать с типом полей **JSONB** в PostgreSql как с обычной моделью в плане выгрузки на клиент. Работает это для **get** запросов в фильтрации и сортировке. Работать можно с полями первого уровня.

source: Integrates with **ApiSpecPlugin** in swagger for **get** requests (for ResourceList views). New fields are added:
ru: Интегрируется с плагином **ApiSpecPlugin** в swagger в **get** запросах (когда выгружается ResourceList). Появились доп. поля:

source: :code:`filter[<JSONB field name in the model>.<upper level JSONB field>]` - simple filter;
ru: :code:`filter[<название JSONB поля в модели>.<название поля верхнего уровня в JSONB>]` - обычные фильтры

source: :code:`filter = [{"name": "<JSONB field name in the model>.<upper level JSONB field>", "op": "eq", "val": "<значение>"}]` - in complex filters, we can request JSONB fields similarly to regular fields in the model.
ru: :code:`filter = [{"name": "<название JSONB поля в модели>__<название\поля верхнего уровня в JSONB>", "op": "eq", "val": "<значение>"}]` - в составных фильтрах также обращаемся к полям внутри JSONB поля, как к полям другой модели.

source: :code:`sort=<JSONB field name in the model>.<upper level JSONB field>` - used as deep sort.
ru: :code:`sort=<название JSONB поля в модели>.<название поля верхнего уровня в JSONB>` - в сортировке используется как глубокая сортировка.

source: Integrates with **PermissionPlugin**, so you can use upper level JSONB fields in permission cases.
ru: Интегрируется с плагином **PermissionPlugin**, можно в пермишен кейсах описать ограничения на поля верхнего уровня в поле модели JSONB.

source: How to use
ru: Работа с плагином

source: To use the plugin in your schemas with JSONB fields do the following:
ru: Чтобы интегрировать плагин в свои схемы, в которых описаны модели с полями JSONB, нужно сделать следующее:

source: In schema, describe JSONB field (from model) as Nested, linking to a schema with upper level fields in model JSONB field.
ru: В схеме описываем поле JSONB (из модели) как Nested, на схему со структурой того, что планируется хранить в JSONB

source: JSONB schema with upper-level fields must be inherited from :code:`combojsonapi.postgresql_jsonb.schema.SchemaJSONB` class.
ru: Схема созданная в первом пункте для хранения структуры из поля модели JSONB должно наследоваться от класса :code:`combojsonapi.postgresql_jsonb.schema.SchemaJSONB`

source: And you're done.
ru: И всё :)

source: Plugin usage example
ru: Пример подключения плагина

source: Let's take a look at example implementation of a plugin, where we store user settings in JSONB field. This example requires a postgresql database connection.
ru: Рассмотрим пример, когда в поле JSONB будем хранить настройки пользователя. Пример будет работать только с подключение к базе данных postgresql

source: Requests example
ru: Пример использования в запросах

source: With views described in example above, we can use new filtering and ordering features.
ru: С views, описанными в примере выше, мы можем пользоваться новыми фильтрами и сортировкой.

source: Request all active users with a simple filter:
ru: Запрос всех активных пользователей простым фильтром:

source: Request all users aged 18 and up with a complex filter, ordered by age desc, then name:
ru: Запрос всех совершеннолетних пользователей (сложный фильтр), сортированных по возрасту по убыванию, затем по имени по возрастанию:
