Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: ru

source: Example
ru: Пример

source: An example of Flask-COMBO-JSONAPI API with ComboJSONAPI looks like this:
ru: Пример использования Flask-COMBO-JSONAPI API с ComboJSONAPI

source: In this example Flask-SQLAlchemy is used, so you'll need to install it before running this example.
ru: В этом примере используется Flask-SQLAlchemy.Так что для запуска примера будет необходимо установить эту библиотеку

source: Save `this file <https://github.com/AdCombo/combojsonapi/blob/master/examples/api.py>`_ as api.py and run it using your Python interpreter. Note that we've enabled `Flask debugging <https://flask.palletsprojects.com/en/2.0.x/quickstart/#debug-mode>`_ mode to provide code reloading and better error messages. ::
ru: Сохраните `этот файл <https://github.com/AdCombo/combojsonapi/blob/master/examples/api.py>`_ как api.py и запустите. В примере активен дебаг режим `Flask debugging <https://flask.palletsprojects.com/en/2.0.x/quickstart/#debug-mode>`_ для авторестарта и более подробных ошибок. ::

source: Debug mode should never be used in a production environment!
ru: Никогда не используйте дебаг режим в продакшене!

source: Classical CRUD operations
ru: Классические CRUD операции

source: Create object
ru: Создание объекта

source: Request:
ru: Запрос:

source: Response:
ru: Ответ:

source: Get object
ru: Получить объект

source: Get objects
ru: Получить объекты

source: Sparse fields
ru: Выборка полей

source: Note that we tell SQLAlchemy that :code:`full_name` requires :code:`first_name` and :code:`first_name` fields. If we don't declare this dependency in model's :code:`Meta.required_fields`, when serialising each model will fire two queries to DB to get these fields.
ru: Необходимо отметить, что мы указали SQLAlchemy что поля :code:`full_name` использует поля :code:`first_name` и :code:`first_name`. Если мы не объявим эту зависимость в :code:`Meta.required_fields` модели, то во время сериализации каждая модель выполнит по два запроса в БД чтобы получить эти поля.

source: It happens because PermissionPlugin removes not requested fields from the SQL query for the sake of performance. And :code:`Meta.required_fields` will tell PermissionPlugin which fields have to be loaded even if not requested directly.
ru: Это происходит потому, что PermissionPlugin убирает невостребованные поля из SQL запроса в пользу производительности. А :code:`Meta.required_fields` подскажет плагину PermissionPlugin какие поля необходимо загрузить даже если они не были запрошены напрямую.
