Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/quickstart_events.po
Languages: ru

source: Events Example
ru: Пример EventPlugin

source: EventPlugin example for Flask-COMBO-JSONAPI API with ComboJSONAPI:
ru: Пример использования плагина EventPlugin в Flask-COMBO-JSONAPI API из ComboJSONAPI

source: In this example Flask-SQLAlchemy is used, so you'll need to install it before running this example.
ru: В этом примере используется Flask-SQLAlchemy.Так что для запуска примера будет необходимо установить эту библиотеку

source: Save `this file <https://github.com/AdCombo/combojsonapi/blob/master/examples/api.py>`_ as api.py and run it using your Python interpreter. Note that we've enabled `Flask debugging <https://flask.palletsprojects.com/en/2.0.x/quickstart/#debug-mode>`_ mode to provide code reloading and better error messages. ::
ru: Сохраните `этот файл <https://github.com/AdCombo/combojsonapi/blob/master/examples/api.py>`_ как api.py и запустите. В примере активен дебаг режим `Flask debugging <https://flask.palletsprojects.com/en/2.0.x/quickstart/#debug-mode>`_ для авторестарта и более подробных ошибок. ::

source: Debug mode should never be used in a production environment!
ru: Никогда не используйте дебаг режим в продакшене!

source: Classical CRUD operations
ru: Классические CRUD операции

source: Create user object
ru: Создание объекта пользователя

source: Request:
ru: Запрос:

source: Response:
ru: Ответ:

source: Get custom event info
ru: Выполнить GET запрос на кастомный :code:`event_get_`

source: Post custom event info
ru: Выполнить POST запрос на кастомный :code:`event_post_`

source: Update user's avatar
ru: Обновить аватар пользователя
