Repository: AdCombo/combojsonapi
Catalog: docs/locale/*/LC_MESSAGES/using_plugins.po
Languages: ru

source: Using Plugins
ru: Работа с плагинами

source: Attaching Plugins
ru: Подключение плагинов

source: Plugins are attached with JSON API initialization. Here's a example of **EventPlugin** usage:
ru: Плагины подключаются в момент инициализации JSON API. Рассмотрим пример подключения плагина **EventPlugin**

source: Plugins API
ru: API для плагинов

source: **Following hooks are available at plugin initialization**
ru: **При реализации плагина доступны следующие hooks**

source: Fired before json_api initializes
ru: срабатывает перед инициализацией json_api

source: :code:`app` - link to Flask instance object
ru: :code:`app` - ссылка на объект приложения Flask.

source: Fired after json_api initializes
ru: срабатывает после инициализации json_api

source: Resource managers pre-parsing before routers are created
ru: Предобработка ресурс менеджеров до создания роутеров

source: :code:`resource` - resource manager;
ru: :code:`resource` - ресурс менеджер;

source: :code:`view` - resource manager name;
ru: :code:`view` - название ресурс менеджера;

source: :code:`urls` - URLs list at which resource will be available;
ru: :code:`urls` - список url, по которым будет доступен данный ресурс;

source: :code:`self_json_api` - link to Api instance.
ru: :code:`self_json_api` - ссылка на объект Api.

source: Resource managers post-parsing after routers are created
ru: Постобработка ресурс менеджеров после создания роутеров

source: Called after marshmallow schema initialization in ResourceList.post
ru: Выполняется после инициализация marshmallow схемы в ResourceList.post

source: :code:`schema` - serialization/deserialization schema linked with the resource;
ru: :code:`schema` - схема, которая привязана к ресурсу для сериализации/десериализации;

source: :code:`model` - model linked with the resource.
ru: :code:`model` - модель, которая привязана к ресурсу.

source: Called after marshmallow schema initialization in ResourceList.get
ru: Выполняется после инициализация marshmallow схемы в ResourceList.get

source: Called after marshmallow schema initialization in ResourceDetail.get
ru: Выполняется после инициализация marshmallow схемы в ResourceDetail.get

source: Called after marshmallow schema initialization in ResourceDetail.patch
ru: Выполняется после инициализация marshmallow схемы в ResourceDetail.patch

source: Called after data deserialization and before forming a database request to create a new object
ru: Выполняется после десериализации данных и до создания запроса к бд на создание нового объекта

source: :code:`data` - deserialized data;
ru: :code:`data` - десериализованнаые данные для создания объекта;

source: :code:`view_kwargs` - resource manager kwargs;
ru: :code:`view_kwargs` - kwargs из ресурс менеджера;

source: Parses input data and returns parsed data set, from which a new object will be created.
ru: Обрабатывает данные, которые пойдут непосредственно на создание нового объекта. Возвращает обновлённый набор данных для нового объекта

source: :code:`Dict data` - deserialized unparsed data set;
ru: :code:`Dict data` - сырые данные, на основе которых будет создан новый объект;

source: :code:`List[str] join_fields` - fields which are linked to other models;
ru: :code:`List[str] join_fields` - список полей, которые являются ссылками на другие модели;

source: Called after object creation but before saving it to the database.
ru: Выполняется после создание нового объекта, но до сохранения в БД

source: :code:`Dict data` - data used to create the new object;
ru: :code:`Dict data` - данные, использованные для создания нового объекта;

source: :code:`obj` - object created from data;
ru: :code:`obj` - новый объект, созданный на основе data;

source: Called during database query creation for updating a single object. Query can be patched here, if needed. Returns patched DB query.
ru: Вызывается во время создания запроса к БД на обновление объекта. Тут можно пропатчить запрос к БД. Возвращает пропатченный запрос к бд

source: :code:`Query query` - generated database query;
ru: :code:`Query query` - сформированный запрос к БД;

source: :code:`QueryStringManager qs` - query parameters list;
ru: :code:`QueryStringManager qs` - список параметров для запроса;

source: Called during database query creation for updating multiple objects. Query can be patched here, if needed. Returns patched DB query.
ru: Во время создания запроса к БД на обновление объектов. Тут можно пропатчить запрос к БД. Возвращает пропатченный запрос к бд

source: Parses data for the object to be updated. Returns parsed data set.
ru: Обрабатывает данные, которые пойдут непосредственно на обновления объекта. Возвращает обновлённый набор данных data для обновления объекта

source: :code:`Dict data` - data with which the object is to be updated;
ru: :code:`Dict data` - данные, которыми будет обновлён объект;

source: :code:`obj` - object to be updated;
ru: :code:`obj` - редактируемый объект;

source: :code:`List[str] join_fields` - fields which are linked to other models.
ru: :code:`List[str] join_fields` - список полей, которые являются ссылками на другие модели.

source: Called before deleting object from the database.
ru: Выполняется до удаления объекта из БД

source: :code:`obj` - object to delete;
ru: :code:`obj` - удаляемый объект;

source: Called before filter is created in Nested.resolve. When returns None, :code:`resolve` continues executing; when returns any other value, :code:`resolve` exits, and the hook function result is passed further in the call stack.
ru: Вызывается до создания фильтра в функции Nested.resolve, если после выполнения вернёт None, то дальше продолжится работа функции resolve, если вернёт какое либо значения отличное от None, то функция resolve завершается, а результат hook функции передаётся дальше в стеке вызова.

source: :code:`self_nested` - :code:`Nested` instance.
ru: :code:`self_nested` - экземпляр :code:`Nested`.

source: Making a New Plugin Example
ru: Пример создания плагинов

source: Let's take a look at example implementation of a plugin that will return data from get requests to :code:`ResourceList`, :code:`ResourceDetail` in a short or detailed view based on pre-set parameter :code:`format=short|full`
ru: Рассмотрим пример реализации плагина, который будет отдавать данные в get запросах для :code:`ResourceList`, :code:`ResourceDetail` в двух вариантах либо все, либо укороченные по заранее заданному параметру :code:`format=short|full`
